{
  "meta": {
    "book_id": "iron_london",
    "title": "The Iron Heel",
    "author": "Jack London",
    "word_count": 86743,
    "total_chapters": 25,
    "total_scenes": 0,
    "world_context": "# World Context\n\n## TONE & STYLE\n- Era/Genre: Early 20th-century Alt-History / Dystopian Socialist Realism.\n- Atmosphere: Oppressive, Militant, Clinical.\n- Prose Voice: A scholarly, retrospective memoir (Avis Everhard) punctuated by cold, analytical footnotes from a distant, enlightened future (Anthony Meredith).\n- Sensory Anchors: The \"put-a-put\" of machine guns; the scent of redwoods at Wake Robin Lodge; the \"scarlet livery\" of the Oligarchy; the roar of the \"Abysmal Beast\" (the mob).\n\n## WORLD RULES / CORE REALITY\n- Tech/Magic Level: Industrial-age technology; wireless stations, armored \"war-automobiles,\" and primitive hot-air balloons used as tactical bombers.\n- Social Order: The Plutocracy (Seven Groups) at the apex; the favored Labor Castes (privileged unions) and Mercenaries as enforcers; the \"People of the Abyss\" (impoverished unorganized labor) at the bottom.\n- Key Constraint: Power is the only arbiter; the Oligarchy maintains control through \"the Iron Heel,\" crushing dissent with economic expropriation and military slaughter.\n- Narrative Structure: A \"Frame Narrative.\" The main text is presented as a \"found manuscript\" annotated by a historian 700 years in the future.\n- Dual Timeframes:\n  1. The \"Present\" (Action): The 1912-1932 Revolt.\n  2. The \"Future\" (Frame): The 27th Century Socialist Utopia (419 B.O.M.).\n\n## PROTAGONIST CONDITIONS\n- Avis Everhard, a convert from the sheltered university class, operates as an undercover agent-provocateur. \n- Her survival depends on total identity transformation as she supports her husband Ernest, the \"Eagle,\" in orchestrating a global socialist revolution against the rising Plutocracy.\n\n## FACTIONS\n- Ruling Power: The Oligarchy; goals are total capitalistic consolidation and the creation of \"Wonder Cities\" (Ardis/Asgard); marked by the scarlet livery and high-culture aesthetic.\n- Resistance: The Socialists/Fighting Groups; goals are the Cooperative Commonwealth and the overthrow of the Iron Heel; marked by red banners and secret hand signals.\n- Third Force: The Mercenaries; professional hereditary soldiers who act as the balance of power between castes.\n\n## LOCATIONS\n- The Abyss (Chicago/Slums): Festering, squalid labor-ghettos characterized by \"nightmare\" violence and \"human lava\" mobs.\n- The Refuge (Sonoma/Wake Robin): Secret, idyllic wilderness hideouts used for training, clandestine meetings, and domestic respite.\n- The Outside: A fractured world-market where Germany, Japan, and the United States clash until unified by Oligarchic alliances.\n\n## NARRATIVE ENGINE\n- Central Conflict: The inevitable, centuries-long struggle between the consolidated Plutocracy and the international socialist revolution.\n- Stakes: If the revolution fails, humanity is doomed to three hundred years of brutal, caste-based slavery under a relentless despotism.\n- Thematic Core: Can a peaceful democratic transition survive the violent \"logic of the club,\" or must social evolution be written in blood?"
  },
  "scenes": []
}
